app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---
        <p><%= link_to "#{post.favorites.count} いいね", post_path(post.id) %></p>
        <p><%= link_to "#{post.post_comments.count} コメント", post_path(post.id) %></p>