app/controllers/members_controller.rb

  def following
        #@memberがフォローしているユーザー
        @member  = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? ORDER BY "members"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @member = current_member
    if @member.update(member_params)
---
UPDATE "members" SET "username" = ?, "introduction" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["username", ""], ["introduction", ""], ["updated_at", "2021-04-16 12:35:44.766300"], ["id", 1]]