app/controllers/posts_controller.rb

  def index
    @post = Post.new
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    post = Post.new(post_params)
    post.save
---
INSERT INTO "posts" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト"], ["category", "ANN"], ["body", "testtest"], ["created_at", "2021-04-16 10:48:29.001433"], ["updated_at", "2021-04-16 10:48:29.001433"]]

  def update
    post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    post = Post.find(params[:id])
    post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]